AurorePeigne/STM32_in_the_sky/GPS_Tracker_L476RG/en.x-cube-gnss1/STM32CubeExpansion_GNSS1_V2.1.0_RC1/Projects/Multi/Applications/FW_Updater/Src/main.c
/**
  *******************************************************************************
  * @file    Applications/FW_Updater/Src/main.c
  * @author  AST/CL
  * @version V2.0.0
  * @date    Apr-2018
  * @brief   Application to be loaded on an STM32 Nucleo board in order to 
  *          use the tool for updating the GNSS Teseo-LIV3F firmware on the 
  *          X-NUCLEO-GNSS1A1 expansion board.
  *

  * \section FW_Updater_Example_Description Example Description
   FW_Updater is the application to be loaded in order to use the tool for
   updating the GNSS Teseo-LIV3F firmware on the X-NUCLEO-GNSS1A1 expansion boards
   (see readme.txt in folder Utilities/PC_Software/FirmwareUpdaterTool).

   Plug the X-NUCLEO-GNSS1A1 expansion board on top of a STM32 Nucleo-F401RE.
   Connect the STM32 Nucleo board to your PC.
   Drag and drop FW_Updater-*.bin (in Binary folder) on Nucleo drive.
   Run the java tool FWUPG.jar (in Utilities/PC_Software/FirmwareUpdaterTool folder).
   From the java GUI, after selecting the right serial port, click Open to start a 
   connection with your STM32 Nucleo and X-NUCLEO-GNSS1A1 boards.
   If the FW version on the Teseo-LIV3F module is not the latest one, click the 
   Update FW >>> button to start the firmware upgrading process.

  * \section FW_Updater_HW_SW_Env Hardware and Software environment

  - This example runs on STM32 Nucleo devices with GNSS STM32 expansion board
    (X-NUCLEO-GNSS1A1)
  - This example has been tested with STMicroelectronics:
    - NUCLEO-F401RE RevC board
    and can be easily tailored to any other supported device and development board.
    This example runs also on the NUCLEO-F411RE RevC board, even if the chip could
    be not exploited at its best since the projects are configured for the
    NUCLEO-F401RE target board.

  * \section FW_Updater_Usage Usage 

 In order to make the program work, you must do the following:
 - WARNING: before opening the project with any toolchain be sure your folder
   installation path is not too in-depth since the toolchain may report errors
   after building.
 - Open IAR toolchain (this firmware has been successfully tested with
   Embedded Workbench V7.80.4).
   Alternatively you can use the Keil uVision toolchain (this firmware
   has been successfully tested with V5.24) or the System Workbench for
   STM32 (this firmware has been successfully tested with Version 2.3.1).
 - Rebuild all files and load your image into target memory.
 - Run the example.
 - Alternatively, you can download the pre-built binaries in "Binary" 
   folder included in the distributed package.
  * 
  *******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        www.st.com/software_license_agreement_liberty_v2
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ********************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "stm32f4xx_nucleo.h"

#include "gnss_app_cfg.h"

#include "config_bus.h"
#include "x_nucleo_gnss1a1.h"

/* Private defines -----------------------------------------------------------*/
//#define PRINT_BYTES_ON_TERMINAL_IO  // if defined enable the print of the data bytes on Terminal I/O
//#define PRINT_MSG_ON_TERMINAL_IO    // if defined enable the print of the message logs on Terminal I/O
//#define PRINT_TIME_ON_TERMINAL_IO   // if defined enable the print of the time logs on Terminal I/O
    
#ifdef PRINT_BYTES_ON_TERMINAL_IO
  #define PRINTBYTES PrintBytes
#else
  #define PRINTBYTES(format, args...) ((void)0)
#endif   
   
#ifdef PRINT_MSG_ON_TERMINAL_IO
  #define PRINTMSG printf
#else
  #define PRINTMSG(format, args...)   ((void)0)
#endif

#ifdef PRINT_TIME_ON_TERMINAL_IO
  #define SETTIME SetTime
  #define PRINTTIME PrintTime 
#else
  #define SETTIME(format, args...) ((void)0)
  #define PRINTTIME(format, args...) ((void)0) 
#endif    

#ifdef PRINT_BYTES_ON_TERMINAL_IO
void PrintBytes(char* direction, uint8_t* buf, uint32_t len);
#endif

#ifdef PRINT_TIME_ON_TERMINAL_IO
void SetTime(uint32_t* time);
void PrintTime(char* direction, uint32_t time0, uint32_t time1);
#endif

/* Short timeout for an UART write (in ms) */
#define UART_WRITE_SHORT_TIMEOUT     (10)
/* Timeout for an UART write (in ms) */
#define UART_WRITE_TIMEOUT           (100)
/* Long timeout for an UART write (in ms) */
#define UART_WRITE_LONG_TIMEOUT      (1000)
/* Very short timeout for an UART read (in ms) */
#define UART_READ_VERY_SHORT_TIMEOUT (1)
/* Timeout for an UART read (in ms) */
#define UART_READ_TIMEOUT            (100)
/* Long timeout for an UART read (in ms) */
#define UART_READ_LONG_TIMEOUT       (3000)

/* Timeout used for some particular operations */
#define UART_READ_STRING_TIMEOUT     (2000)
#define UART_READ_READY_ACK_TIMEOUT  (8000)
#define UART_READ_CHUNK_ACK_TIMEOUT  (3500)
#define UART_READ_CRC_ACK_TIMEOUT    (10000)

