AurorePeigne/STM32_in_the_sky/GPS_Tracker_L476RG/en.x-cube-gnss1/STM32CubeExpansion_GNSS1_V2.1.0_RC1/Projects/Multi/Applications/FW_Updater/Src/main.c
          HAL_Delay(500);

          ver = Get_GNSS_FW_Version();
          (void)memcpy(ver_buf, ver, (uint32_t)strlen(ver));
          PRINTMSG("version fw = %s\n", ver);
          status = HAL_UART_Transmit(&io_huart, (uint8_t*)ver_buf, (uint16_t)strlen(ver_buf), UART_WRITE_TIMEOUT);            
          if (status != HAL_OK)
          {
            Error_Handler();
          }
          already_flashed = 1;
          break;
        }
      }
    }
  }
}

/*	
 * This function sends the NMEA $PSTMGETSWVER command and returns
 * the firmware image version
 */
static char* Get_GNSS_FW_Version(void) 
{
  char* ver = NULL;
  HAL_StatusTypeDef status;  
  uint16_t buffer_sz = 512;

  while (ver == NULL)
  {
    status = HAL_UART_Transmit(&huart, (uint8_t *)"$PSTMGETSWVER,6\n\r", (uint16_t)sizeof("$PSTMGETSWVER,6\n\r"), UART_WRITE_TIMEOUT);
    if (status == HAL_OK)
    {
      status = HAL_UART_Receive(&huart, rxBuffer, buffer_sz, UART_READ_STRING_TIMEOUT);
      if ((status != HAL_OK) && (status != HAL_TIMEOUT))
      {
        Error_Handler();
      }
      ver = TESEO_Detect_Sentence("PSTMVER,BINIMG", rxBuffer, buffer_sz);
      HAL_Delay(500);
    }
  }
  return ver;
}

/*
 * This function detects a string from a received response
 */
static char* TESEO_Detect_Sentence(const char *rsp, uint8_t *buf, uint32_t len)
{
  char *result = NULL;
  uint32_t i = 0;
  const unsigned long rsp_len = strlen(rsp);
  len -= strlen(rsp);
  
  PRINTBYTES("rx_1", buf, len); 
  
  while (!result && i < len)
  {
    for (; buf[i] != '$' && i < len; ++i); /* 1. check '$' char */
    if (i == len)
      break; /* no more char.... */
    
    ++i; /* to point to the char after '$' */
    
    if (strncmp(&((char*)buf)[i], rsp, rsp_len) == 0)
    {
      result = &((char*)buf)[i];
    }
  }
  
  if (result)
  {
    for (i = 0; result[i] != '*'; ++i);
    result[i] = 0;
  }
    
  return result;
  
}

#ifdef PRINT_BYTES_ON_TERMINAL_IO
/*
 * This function print on terminal IO the bytes read/written from/to both the UART
 */
void PrintBytes(char* direction, uint8_t* buf, uint32_t len)
{
  uint32_t i;
  
  printf("[-%s-]%d;", direction, len);
  for (i=0; i<len; i++)
  {
    printf("%02x ", buf[i]);
    //printf("%c", buf[i]);
  }
  printf("\n");
}
#endif

#ifdef PRINT_TIME_ON_TERMINAL_IO
/* Assign to a variable the value of the HAL_GetTick() */
void SetTime (uint32_t* time)
{
  *time = HAL_GetTick();
}

/* Assign to a variable the value of the HAL_GetTick() */
void PrintTime (char* direction, uint32_t time0, uint32_t time1)
{
  uint32_t diff = time1 - time0;
  
  printf("[-%s-]%d (ms);\n", direction, diff);
}
#endif

/* Configures GPIO */
static void GPIO_Config(void)
{
   GPIO_InitTypeDef GPIO_InitStruct;
  
  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  
  /* Configure GPIO pin Output Level */
  GNSS_RST_PIN_SET();
  
  /* Configure Reset */
  GPIO_InitStruct.Pin = GNSS_RST_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GNSS_RST_PORT, &GPIO_InitStruct);
#if 0
  /*Configure GPIO pin : PA5 */
  GPIO_InitStruct.Pin = GNSS_WAKEUP_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GNSS_WAKEUP_PORT, &GPIO_InitStruct);
#endif
}

/* System Clock Configuration */
void SystemClock_Config(void)
{
  
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  
  __HAL_RCC_PWR_CLK_ENABLE();
  
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);
  
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  
  /**Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
    |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  
  /**Configure the Systick interrupt time 
  */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);
  
  /**Configure the Systick 
  */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
  
  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
}


/*
* This function is executed in case of error occurrence.
*/
void Error_Handler(void)
{
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
}

#ifdef USE_FULL_ASSERT

/* Reports the name of the source file and the source line number */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
  ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
}

#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

